/* 
* Copyright (c) 2011 - 2011, 凯特科技
* All rights reserved. 
* 
*  
* 文件名称：$HeadURL: svn://www.svnhost.cn/Others/Trunk/UcosTest/Config.h $ 
* 摘    要：
*  
* 当前版本：$Revision: 631 $
* 最后修改：$Author: flyaqiao $
* 修改日期：$LastChangedDate:: 2011-10-21 00:33:16#$
*
*/
#ifndef _CONFIG_H
#define _CONFIG_H

/*
//-------- <<< Use Configuration Wizard in Context Menu >>> ------------------
*/

/*--------------------- GPIO0 Connect Configuration ----------------------------------
//
// <E> GPIO0 Configuration
//    <H> P0_0
//      <O1.0..2> FUNC	(选择管脚功能)
//                <0=> RESET
//                <1=> GPIO
//			<O1.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O1.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>
//    <H> P0_1
//      <O2.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO
//                <1=> CLKOUT
//								<2=> CT32B0_MAT2
//			<O2.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O2.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>
//    <H> P0_2
//      <O3.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> SSEL0
//                <2=> CT16B0_CAP0
//			<O3.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O3.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>		
//    <H> P0_3
//      <O4.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO
//			<O4.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O4.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>	 
//    <H> P0_4
//      <O5.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> SCL
//			<O5.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O5.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//      <O5.8..9> I2CMODE	(选择I2C模式)
//                <0=> 标准模式/快速模式I2C
//                <1=> 标准I/O功能
//								<2=> 快速模式Plus I2C
//		</H>	
//    <H> P0_5
//      <O6.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> SDA
//			<O6.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O6.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//      <O6.8..9> I2CMODE	(选择I2C模式)
//                <0=> 标准模式/快速模式I2C
//                <1=> 标准I/O功能
//								<2=> 快速模式Plus I2C
//		</H>			
//    <H> P0_6
//      <O7.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <2=> SCK0
//			<O7.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O7.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>					
//    <H> P0_7
//      <O8.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> CTS
//			<O8.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O8.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能			
//		</H>		 					
//    <H> P0_8
//      <O9.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> MISO0
//                <2=> CT16B0_MAP0
//			<O9.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O9.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>			 	 					
//    <H> P0_9
//      <O10.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> MOSI0
//                <2=> CT16B0_MAP0
//			<O10.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O10.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>		  	 					
//    <H> P0_10
//      <O11.0..2> FUNC	(选择管脚功能)
//                <0=> SWCLK						
//                <1=> GPIO
//                <2=> SCK0	 
//                <3=> CT16B0_MAT2
//			<O11.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O11.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>	   	 					
//    <H> P0_11
//      <O12.0..2> FUNC	(选择管脚功能)
//                <0=> TDI						
//                <1=> GPIO
//                <2=> AD0	 
//                <3=> CT32B0_MAT3
//			<O12.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O12.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//      <O12.6..7> ADMODE	(选择模拟/数字模式)
//                <0=> 模拟输入模式
//                <2=> 数字功能模式	
//		</H>	
// </E>
*/
 
#define GPIO0_SETUP             1
#define P0_0_CON							0x91
#define P0_1_CON							0x90	
#define P0_2_CON							0x90
#define P0_3_CON							0x90
#define P0_4_CON							0x90
#define P0_5_CON							0x90
#define P0_6_CON							0x90
#define P0_7_CON							0x90	
#define P0_8_CON							0x90
#define P0_9_CON							0x90
#define P0_10_CON							0x90
#define P0_11_CON							0x91

/*--------------------- GPIO1 Connect Configuration ----------------------------------
//
// <E> GPIO1 Configuration
//    <H> P1_0
//      <O1.0..2> FUNC	(选择管脚功能)
//                <0=> TMS
//                <1=> GPIO			
//                <2=> AD1
//                <3=> CT32B1_CAP0
//			<O1.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O1.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//      <O1.6..7> ADMODE	(选择模拟/数字模式)
//                <0=> 模拟输入模式
//                <2=> 数字功能模式	
//		</H>
//    <H> P1_1
//      <O2.0..2> FUNC	(选择管脚功能)
//                <0=> TDO
//                <1=> GPIO		 
//                <2=> AD2
//								<3=> CT32B1_MAT0
//			<O2.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O2.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//      <O2.6..7> ADMODE	(选择模拟/数字模式)
//                <0=> 模拟输入模式
//                <2=> 数字功能模式	
//		</H>
//    <H> P1_2
//      <O3.0..2> FUNC	(选择管脚功能)
//                <0=> TRST						
//                <1=> GPIO
//                <2=> AD3	 
//                <3=> CT32B1_MAT1
//			<O3.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O3.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//      <O3.6..7> ADMODE	(选择模拟/数字模式)
//                <0=> 模拟输入模式
//                <2=> 数字功能模式	
//		</H>		
//    <H> P1_3
//      <O4.0..2> FUNC	(选择管脚功能) 
//                <0=> SWDIO
//                <1=> GPIO					
//                <2=> AD4					
//                <3=> CT32B1_MAT2
//			<O4.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O4.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//      <O4.6..7> ADMODE	(选择模拟/数字模式)
//                <0=> 模拟输入模式
//                <2=> 数字功能模式	
//		</H>	 
//    <H> P1_4
//      <O5.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> AD5							
//                <2=> CT32B1_MAT3
//			<O5.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O5.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//      <O5.6..7> ADMODE	(选择模拟/数字模式)
//                <0=> 模拟输入模式
//                <2=> 数字功能模式	
//		</H>	
//    <H> P1_5
//      <O6.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> RTS	 					
//                <2=> CT32B0_CAP0
//			<O6.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O6.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>			
//    <H> P1_6
//      <O7.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> RXD	
//                <2=> CT32B0_MAT0
//			<O7.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O7.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能	
//		</H>					
//    <H> P1_7
//      <O8.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> TXD	 					
//                <2=> CT32B0_MAT1
//			<O8.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O8.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能	
//		</H>		 					
//    <H> P1_8
//      <O9.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> CT16B1_CAP1
//			<O9.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O9.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>			 	 					
//    <H> P1_9
//      <O10.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> CT16B1_MAT1
//			<O10.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O10.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能			
//		</H>		  	 					
//    <H> P1_10
//      <O11.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> AD6
//                <2=> CT16B1_MAT1
//			<O11.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O11.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//      <O11.6..7> ADMODE	(选择模拟/数字模式)
//                <0=> 模拟输入模式
//                <2=> 数字功能模式	
//		</H>	   	 					
//    <H> P1_11
//      <O12.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> AD7
//			<O12.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O12.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//      <O12.6..7> ADMODE	(选择模拟/数字模式)
//                <0=> 模拟输入模式
//                <2=> 数字功能模式	
//		</H>	
// </E>
*/

#define GPIO1_SETUP             1
#define P1_0_CON							0x91
#define P1_1_CON							0x91	
#define P1_2_CON							0x90
#define P1_3_CON							0x90
#define P1_4_CON							0x90
#define P1_5_CON							0x90
#define P1_6_CON							0x91
#define P1_7_CON							0x91	
#define P1_8_CON							0x90
#define P1_9_CON							0x90
#define P1_10_CON							0x90
#define P1_11_CON							0x90

/*--------------------- GPIO0 Connect Configuration ----------------------------------
//
// <E> GPIO2 Configuration
//    <H> P2_0
//      <O1.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO
//                <1=> DTR	
//                <2=> SSEL1
//			<O1.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O1.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>
//    <H> P2_1
//      <O2.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO
//                <1=> DSR
//								<2=> SCK1
//			<O2.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O2.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>
//    <H> P2_2
//      <O3.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> DCD
//                <2=> MISO1
//			<O3.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O3.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>		
//    <H> P2_3
//      <O4.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO							
//                <1=> RI     					
//                <2=> MOSI1
//			<O4.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O4.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>	 
//    <H> P2_4
//      <O5.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO	
//			<O5.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O5.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能			
//		</H>	
//    <H> P2_5
//      <O6.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO		
//			<O6.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O6.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>			
//    <H> P2_6
//      <O7.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO	
//			<O7.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O7.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>					
//    <H> P2_7
//      <O8.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO	
//			<O8.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O8.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>		 					
//    <H> P2_8
//      <O9.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO			
//			<O9.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O9.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>			 	 					
//    <H> P2_9
//      <O10.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO		
//			<O10.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O10.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能			
//		</H>		  	 					
//    <H> P2_10
//      <O11.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO
//			<O11.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O11.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>	   	 					
//    <H> P2_11
//      <O12.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> SCK0
//			<O12.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O12.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>	
// </E>
*/
 
#define GPIO2_SETUP             1
#define P2_0_CON							0x90
#define P2_1_CON							0x92	
#define P2_2_CON							0x92
#define P2_3_CON							0x92
#define P2_4_CON							0x90
#define P2_5_CON							0x90
#define P2_6_CON							0x90
#define P2_7_CON							0x90	
#define P2_8_CON							0x90
#define P2_9_CON							0x90
#define P2_10_CON							0x90
#define P2_11_CON							0x90

/*--------------------- GPIO0 Connect Configuration ----------------------------------
//
// <E> GPIO3 Configuration
//    <H> P3_0
//      <O1.0..2> FUNC	(选择管脚功能)
//                <0=> RESET
//                <1=> DTR
//			<O1.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O1.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能			
//		</H>
//    <H> P3_1
//      <O2.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO
//			<O2.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O2.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>
//    <H> P3_2
//      <O3.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						
//                <1=> DCD
//			<O3.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O3.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>		
//    <H> P3_3
//      <O4.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO						 
//                <1=> RI
//			<O4.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O4.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>	 
//    <H> P3_4
//      <O5.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO			
//			<O5.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O5.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能		
//		</H>	
//    <H> P3_5
//      <O6.0..2> FUNC	(选择管脚功能)
//                <0=> GPIO	
//			<O6.3..4> MODE	(选择功能模式)		
//                <0=> 无效
//                <1=> 下拉电阻使能	
//                <2=> 上拉电阻使能			
//                <3=> 中继模式	
//      <O6.5> HYS	(滞后作用)
//                <0=> 禁能
//                <1=> 使能			
//		</H>		
// </E>
*/
 
#define GPIO3_SETUP             1
#define P3_0_CON							0x90
#define P3_1_CON							0x90	
#define P3_2_CON							0x90
#define P3_3_CON							0x90
#define P3_4_CON							0x90
#define P3_5_CON							0x90

/*--------------------- SCK Connect Configuration ----------------------------------
//
// <E> 位置寄存器
//    <H> SCK
//      <O1.0..1> 选择SCK0管脚的位置
//                <0=> 在管脚P0_10选择SCK0
//                <1=> 在管脚P2_11选择SCK0	
//                <2=> 在管脚P0_6选择SCK0
//		</H>
//    <H> DSR
//      <O1.0..1> 选择DSR0管脚的位置
//                <0=> 在管脚P2_1选择DSR0
//                <1=> 在管脚P3_1选择DSR0
//		</H> 
//    <H> DCD
//      <O1.0..1> 选择DCD管脚的位置
//                <0=> 在管脚P2_2选择DSR0
//                <1=> 在管脚P3_2选择DSR0
//		</H>	 
//    <H> RI
//      <O1.0..1> 选择RI管脚的位置
//                <0=> 在管脚P2_3选择DSR0
//                <1=> 在管脚P3_3选择DSR0
//		</H>
// </E>
*/
#define LOC_SETUP							1
#define	SCK_LOC_CON						0x00
#define DSR_LOC_CON						0x00
#define DCD_LOC_CON						0x00
#define RI_LOC_CON						0x00

/*--------------------- GPIO Direction Configuration ----------------------------------
//
// <E> GPIO状态
//    <H> GPIO 0
//      <Q1.0> P0_0	输出 
//      <Q1.1> P0_1	输出
//      <Q1.2> P0_2	输出
//      <Q1.3> P0_3	输出
//      <Q1.4> P0_4	输出		
//      <Q1.5> P0_5	输出
//      <Q1.6> P0_6	输出
//      <Q1.7> P0_7	输出
//      <Q1.8> P0_8	输出 
//      <Q1.9> P0_9	输出
//      <Q1.10> P0_10	输出
//      <Q1.11> P0_11	输出
//		</H>								 
//    <H> GPIO 1
//      <Q2.0> P1_0	输出 
//      <Q2.1> P1_1	输出
//      <Q2.2> P1_2	输出
//      <Q2.3> P1_3	输出
//      <Q2.4> P1_4	输出		
//      <Q2.5> P1_5	输出
//      <Q2.6> P1_6	输出
//      <Q2.7> P1_7	输出
//      <Q2.8> P1_8	输出 
//      <Q2.9> P1_9	输出
//      <Q2.10> P1_10	输出
//      <Q2.11> P1_11	输出
//		</H>
//    <H> GPIO 2
//      <Q3.0> P2_0	输出 
//      <Q3.1> P2_1	输出
//      <Q3.2> P2_2	输出
//      <Q3.3> P2_3	输出
//      <Q3.4> P2_4	输出		
//      <Q3.5> P2_5	输出
//      <Q3.6> P2_6	输出
//      <Q3.7> P2_7	输出
//      <Q3.8> P2_8	输出 
//      <Q3.9> P2_9	输出
//      <Q3.10> P2_10	输出
//      <Q3.11> P2_11	输出
//		</H>
//    <H> GPIO 3
//      <Q4.0> P3_0	输出 
//      <Q4.1> P3_1	输出
//      <Q4.2> P3_2	输出
//      <Q4.3> P3_3	输出
//      <Q4.4> P3_4	输出		
//      <Q4.5> P3_5	输出
//		</H>
// </E>
*/
#define GPIO_SETUP						1
#define	GPIO0_DIR							0x0080
#define	GPIO1_DIR							0x0000
#define	GPIO2_DIR							0x0000
#define	GPIO3_DIR							0x0000

/*
//-------- <<< end of configuration section >>> ------------------------------
*/

void GpioConfig(void)
{
#if	GPIO0_SETUP
	LPC_IOCON->RESET_PIO0_0				= P0_0_CON;
	LPC_IOCON->PIO0_1							= P0_1_CON;
	LPC_IOCON->PIO0_2							= P0_2_CON;
	LPC_IOCON->PIO0_3							= P0_3_CON;
	LPC_IOCON->PIO0_4							= P0_4_CON;
	LPC_IOCON->PIO0_5							= P0_5_CON;
	LPC_IOCON->PIO0_6							= P0_6_CON;
	LPC_IOCON->PIO0_7							= P0_7_CON;
	LPC_IOCON->PIO0_8							= P0_8_CON;		
	LPC_IOCON->PIO0_9							= P0_9_CON;
	LPC_IOCON->SWCLK_PIO0_10		  = P0_10_CON;
	LPC_IOCON->R_PIO0_11		      = P0_11_CON;
#endif		
#if GPIO1_SETUP
	LPC_IOCON->R_PIO1_0		        = P1_0_CON;
	LPC_IOCON->R_PIO1_1		        = P1_1_CON;
	LPC_IOCON->R_PIO1_2	          = P1_2_CON;
	LPC_IOCON->SWDIO_PIO1_3		    = P1_3_CON;
	LPC_IOCON->PIO1_4							= P1_4_CON;
	LPC_IOCON->PIO1_5							= P1_5_CON;
	LPC_IOCON->PIO1_6							= P1_6_CON;
	LPC_IOCON->PIO1_7							= P1_7_CON;
	LPC_IOCON->PIO1_8							= P1_8_CON;		
	LPC_IOCON->PIO1_9							= P1_9_CON;
	LPC_IOCON->PIO1_10						= P1_10_CON;
	LPC_IOCON->PIO1_11						= P1_11_CON;
#endif
#if GPIO2_SETUP			
	LPC_IOCON->PIO2_0							= P2_0_CON;
	LPC_IOCON->PIO2_1							= P2_1_CON;
	LPC_IOCON->PIO2_2							= P2_2_CON;
	LPC_IOCON->PIO2_3							= P2_3_CON;
	LPC_IOCON->PIO2_4							= P2_4_CON;
	LPC_IOCON->PIO2_5							= P2_5_CON;
	LPC_IOCON->PIO2_6							= P2_6_CON;
	LPC_IOCON->PIO2_7							= P2_7_CON;
	LPC_IOCON->PIO2_8							= P2_8_CON;		
	LPC_IOCON->PIO2_9							= P2_9_CON;
	LPC_IOCON->PIO2_10						= P2_10_CON;
	LPC_IOCON->PIO2_11						= P2_11_CON;	
#endif
#if GPIO3_SETUP		
	LPC_IOCON->PIO3_0							= P3_0_CON;
	LPC_IOCON->PIO3_1							= P3_1_CON;
	LPC_IOCON->PIO3_2							= P3_2_CON;
	LPC_IOCON->PIO3_3							= P3_3_CON;
	LPC_IOCON->PIO3_4							= P3_4_CON;
	LPC_IOCON->PIO3_5							= P3_5_CON;
#endif
#if LOC_SETUP
	LPC_IOCON->SCK_LOC						= SCK_LOC_CON; 
	LPC_IOCON->DSR_LOC						= DSR_LOC_CON;
	LPC_IOCON->DCD_LOC						= DCD_LOC_CON;
	LPC_IOCON->RI_LOC							= RI_LOC_CON;
#endif
#if GPIO_SETUP
	LPC_GPIO0->DIR								= GPIO0_DIR;
	LPC_GPIO1->DIR								= GPIO1_DIR;
	LPC_GPIO2->DIR								= GPIO2_DIR;
	LPC_GPIO3->DIR								= GPIO3_DIR;
#endif
}
#endif	// _CONFIG_H
